<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Data-engineering-syntax-assessment" data-toc-modified-id="Data-engineering-syntax-assessment-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Data engineering syntax assessment</a></span><ul class="toc-item"><li><span><a href="#Question-1" data-toc-modified-id="Question-1-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>Question 1</a></span><ul class="toc-item"><li><span><a href="#Write-R-or-Pandas-code-to-de-dup-STUDENTS" data-toc-modified-id="Write-R-or-Pandas-code-to-de-dup-STUDENTS-1.1.1"><span class="toc-item-num">1.1.1&nbsp;&nbsp;</span>Write R or Pandas code to de-dup STUDENTS</a></span></li><li><span><a href="#Create-a-data-frame-COUNTS-storing-the-count-of-students-for-each-continent,-college-pair" data-toc-modified-id="Create-a-data-frame-COUNTS-storing-the-count-of-students-for-each-continent,-college-pair-1.1.2"><span class="toc-item-num">1.1.2&nbsp;&nbsp;</span>Create a data frame COUNTS storing the count of students for each continent, college pair</a></span></li><li><span><a href="#If-applicable,-remove-any-unnecessary-index-levels-created-in-part-C" data-toc-modified-id="If-applicable,-remove-any-unnecessary-index-levels-created-in-part-C-1.1.3"><span class="toc-item-num">1.1.3&nbsp;&nbsp;</span>If applicable, remove any unnecessary index levels created in part C</a></span></li><li><span><a href="#Pivot-COUNTS-so-that-continent-values-become-column-names" data-toc-modified-id="Pivot-COUNTS-so-that-continent-values-become-column-names-1.1.4"><span class="toc-item-num">1.1.4&nbsp;&nbsp;</span>Pivot COUNTS so that continent values become column names</a></span></li><li><span><a href="#Zero-fill-missing-values-in-COUNTS" data-toc-modified-id="Zero-fill-missing-values-in-COUNTS-1.1.5"><span class="toc-item-num">1.1.5&nbsp;&nbsp;</span>Zero-fill missing values in COUNTS</a></span></li><li><span><a href="#Sort-COUNTS-reverse-alphabetically-by-college-name" data-toc-modified-id="Sort-COUNTS-reverse-alphabetically-by-college-name-1.1.6"><span class="toc-item-num">1.1.6&nbsp;&nbsp;</span>Sort COUNTS reverse alphabetically by college name</a></span></li></ul></li><li><span><a href="#Question-2" data-toc-modified-id="Question-2-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>Question 2</a></span><ul class="toc-item"><li><span><a href="#Of-the-months-April,-May,-and-June,-calculate-how-many-had-eggs>100" data-toc-modified-id="Of-the-months-April,-May,-and-June,-calculate-how-many-had-eggs>100-1.2.1"><span class="toc-item-num">1.2.1&nbsp;&nbsp;</span>Of the months April, May, and June, calculate how many had eggs&gt;100</a></span></li><li><span><a href="#Complete-the-script-to-produce-the-output-shown" data-toc-modified-id="Complete-the-script-to-produce-the-output-shown-1.2.2"><span class="toc-item-num">1.2.2&nbsp;&nbsp;</span>Complete the script to produce the output shown</a></span></li><li><span><a href="#How-would-you-create-a-new-object-with:" data-toc-modified-id="How-would-you-create-a-new-object-with:-1.2.3"><span class="toc-item-num">1.2.3&nbsp;&nbsp;</span>How would you create a new object with:</a></span></li></ul></li></ul></li><li><span><a href="#R" data-toc-modified-id="R-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>R</a></span><ul class="toc-item"><li><span><a href="#A)----Select-the-answer-to-complete-the-assigned-task" data-toc-modified-id="A)----Select-the-answer-to-complete-the-assigned-task-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>A)    Select the answer to complete the assigned task</a></span></li><li><span><a href="#B)----Complete-the-script-to-produce-the-output-shown" data-toc-modified-id="B)----Complete-the-script-to-produce-the-output-shown-2.2"><span class="toc-item-num">2.2&nbsp;&nbsp;</span>B)    Complete the script to produce the output shown</a></span></li><li><span><a href="#C)-Select-the-correct-script-to-accomplish-the-task" data-toc-modified-id="C)-Select-the-correct-script-to-accomplish-the-task-2.3"><span class="toc-item-num">2.3&nbsp;&nbsp;</span>C) Select the correct script to accomplish the task</a></span></li></ul></li></ul></div>

## Data engineering syntax assessment

In [1]:
import pandas as pd 
import numpy as np

### Question 1

In [2]:
d = {'name': ['Andy', 'Jose', 'Dieu', 'Chloe', 'Jose'], 
     'continent': ['America', 'Europe', 'Asia', 'America','Europe'],
     'college': ['Lib Arts', 'Business', 'Engineering','Engineering','Business']
    }
pdf = pd.DataFrame(d)

In [3]:
pdf.head()

    name continent      college
0   Andy   America     Lib Arts
1   Jose    Europe     Business
2   Dieu      Asia  Engineering
3  Chloe   America  Engineering
4   Jose    Europe     Business

#### Write R or Pandas code to de-dup STUDENTS

In [4]:
pdf2 = pdf.drop_duplicates(subset=None, keep="first", inplace=False)

In [5]:
pdf2.head()

    name continent      college
0   Andy   America     Lib Arts
1   Jose    Europe     Business
2   Dieu      Asia  Engineering
3  Chloe   America  Engineering

#### Create a data frame COUNTS storing the count of students for each continent, college pair

In [6]:
counts = pdf2.groupby(['continent','college'])\
             .count()

In [7]:
counts

                       name
continent college
America   Engineering     1
          Lib Arts        1
Asia      Engineering     1
Europe    Business        1

####  If applicable, remove any unnecessary index levels created in part C

In [8]:
counts = counts.reset_index()

In [9]:
counts

  continent      college  name
0   America  Engineering     1
1   America     Lib Arts     1
2      Asia  Engineering     1
3    Europe     Business     1

#### Pivot COUNTS so that continent values become column names

In [10]:
counts = counts.pivot(index='college', columns='continent', values='name')

In [11]:
counts

continent    America  Asia  Europe
college
Business         NaN   NaN     1.0
Engineering      1.0   1.0     NaN
Lib Arts         1.0   NaN     NaN

#### Zero-fill missing values in COUNTS

In [12]:
counts = counts.fillna(0)

In [13]:
counts

continent    America  Asia  Europe
college
Business         0.0   0.0     1.0
Engineering      1.0   1.0     0.0
Lib Arts         1.0   0.0     0.0

#### Sort COUNTS reverse alphabetically by college name

In [14]:
counts = counts.sort_values(['college'],ascending=False)

In [15]:
counts

continent    America  Asia  Europe
college
Lib Arts         1.0   0.0     0.0
Engineering      1.0   1.0     0.0
Business         0.0   0.0     1.0

### Question 2

#### Of the months April, May, and June, calculate how many had eggs>100

Answer: 
<span style='background :yellow' > A </span>

#### Complete the script to produce the output shown
Output
datetime.date(2018, 1, 1)

Script
import datetime
datetime.datetime._______(‘01012018’, “%d%m%Y”)________

Answer: 
<span style='background :yellow' > A </span>

#### How would you create a new object with:
    -	only the “setosa” species 
    -	Petal.Width greater than 2
    -	Sorted by Sepal.Length in descending order

Answer: 
<span style='background :yellow' > B </span>

##  R

### A)	Select the answer to complete the assigned task

Answer: 
<span style='background :yellow' > C </span>

### B)	Complete the script to produce the output shown 
Output
[1] “2000-06-09”

Script
x <- “9_June_2000”
_______(x, format = “%d_%B_%Y”)

Answer: 
<span style='background :yellow' > C </span>

### C) Select the correct script to accomplish the task 

How would you create a new object with:
-	only the “setosa” species 
-	Petal.Width greater than 2
-	Sorted by Sepal.Length in descending order

Answer: 
<span style='background :yellow' > C </span>